#include <iostream>
#include <graphics.h>

using namespace std;

int main()
{
    initwindow(800, 600, "Five-Star Red Flag"); // 创建800x600的窗口

    setfillstyle(SOLID_FILL, RED); // 设置填充颜色为红色
    bar(0, 0, 800, 600); // 绘制红色背景

    setfillstyle(SOLID_FILL, YELLOW); // 设置填充颜色为黄色
    int x[10] = {283, 325, 325, 365, 407, 383, 407, 365, 325, 325};
    int y[10] = {180, 180, 137, 180, 180, 218, 262, 218, 262, 218};
    fillpoly(5, x, y); // 绘制大五角星

    setfillstyle(SOLID_FILL, RED); // 设置填充颜色为红色
    int x1[10] = {316, 307, 298, 284, 275, 279, 270, 282, 298, 292};
    int y1[10] = {218, 233, 233, 245, 259, 250, 265, 257, 257, 240};
    fillpoly(5, x1, y1); // 绘制小五角星1

    int x2[10] = {340, 349, 358, 372, 381, 377, 386, 374, 358, 364};
    int y2[10] = {218, 233, 233, 245, 259, 250, 265, 257, 257, 240};
    fillpoly(5, x2, y2); // 绘制小五角星2

    int x3[10] = {316, 325, 333, 348, 357, 353, 362, 350, 333, 339};
    int y3[10] = {240, 255, 255, 267, 281, 272, 287, 279, 279, 262};
    fillpoly(5, x3, y3); // 绘制小五角星3

    int x4[10] = {340, 331, 323, 307, 298, 302, 293, 305, 322, 316};
    int y4[10] = {240, 255, 255, 267, 281, 272, 287, 279, 279, 262};
    fillpoly(5, x4, y4); // 绘制小五角星4

    getch();
    closegraph();
    return 0;
}

